app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY movies.release_date
---
  def index
    @all_ratings = Movie.all_ratings #instance var used in the view

    #filter by ratings: default/initially is ALL
    if params[:ratings] == nil #if no checkboxes clicked, no filter
      @filterby = @all_ratings
    else #if checkboxes clicked, filter by ratings
      @filterby = params[:ratings].keys
    end

    #sort by order: default is sort by DB id #
    #set style of sorted list header
    if params[:order] == 'movies.title'
      @titlestyle = 'hilite'
    elsif params[:order] == 'movies.release_date'
      @datestyle = 'hilite'
    end

    #sort and filter list of movies for the view
    @movies = Movie.where(:rating => @filterby).find(:all, :order => params[:order])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "13"]]
UPDATE "movies" SET "rating" = 'PG-13', "updated_at" = '2013-10-08 01:11:09.392021' WHERE "movies"."id" = 13
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])